
//**--------------头文件-------------------------------------------------------
#include <xc.h>
#include <GenericTypeDefs.h>

#include "userdefine.h"

/**********************************************************************
*函数名称：delay_1us
*描述：1us软件延时
*返回类型：void
*输入形参：void
***********************************************************************/
void delay_1us(void) // 延时1us，因为系统时钟是8MHZ，一条指令时间是1/8M * 4 = 500ns = 0.5us
{
	NOP(); // 0.5us
	NOP(); // 0.5us
}

/**********************************************************************
*函数名称：delay_ms
*描述：1ms软件延时
*返回类型：void
*输入形参：void
***********************************************************************/
void delay_ms(unsigned int count)
{
	WORD i, j;
	
	for (i = 0; i < count; i++)
	{
    	for (j = 0; j < 150; j++)
    	{
    		NOP();
    	}
   	}
}
