

//**--------------头文件-------------------------------------------------------
#include <xc.h>
#include <GenericTypeDefs.h>

#include "userdefine.h"




/******************************************************************************
** 函数名称 : init_led
** 输入参数 : 无
** 输出参数 : 无
** 功能描述 : 
*******************************************************************************/
void init_led(void)
{
	RUN_LED_TRIS = 0; // 设置运行指示灯 管脚--输出模式 RC2
	RS1_LED_TRIS = 0; // 设置RS1指示灯	管脚--输出模式 RC3
	RS2_LED_TRIS = 0; // 设置RS2指示灯	管脚--输出模式 RC4

	RUN_LED_ON; // 点亮D4
	RS1_LED_ON; // 点亮D5
	RS2_LED_ON;	// 点亮D6
}
